src/cf/src/Documents/АктыВыполненныхРабот/АктыВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктыВыполненныхРабот</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСОрганизациями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусАктаВыполненныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругаяСуммаСогласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОтветственного</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗадач</name>
    <attributes>
      <name>Задача</name>
      <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
      <type>
        <types>TaskRef.ЗадачиПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Трудоемкость</name>
      <type>
        <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ВзаиморасчетыСОрганизациями/ВзаиморасчетыСОрганизациями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСОрганизациями</name>
  <resources>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/СтатусАктаВыполненныхРабот/СтатусАктаВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусАктаВыполненныхРабот</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ИзбранныеПроекты</name>
      <description>!Избранные проекты</description>
    </items>
    <items>
      <name>БезПроекта</name>
      <description>Без проекта</description>
    </items>
  </predefined>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетАктовВыполненныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачиПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПроект</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательУслуг</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьНаЗаполненностьВидЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентПроекта</name>
    <type>
      <types>CatalogRef.ПроектыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполненияДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧаса</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийОбработкиЗадач</name>
    <type>
      <types>CatalogRef.СценарииОбработкиЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользователиПроекта</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
        <types>CatalogRef.РабочиеМеста</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Организации</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьЕmail</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/АктыВыполненныхРабот/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// это новый фиксируем в реквизите формы
		ЭтоНовый = Истина;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоНовый Тогда
		Объект.Дата = КонецДня(Объект.Дата);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Оповестить("Изменение_ФактическиеТрудозатратыЗадачи", , Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаполнитьРаботыПоЗадачи(Команда)
	
	ЗаполнитьРаботыПоЗадачиСервер();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаботыПоЗадачиСервер()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСОрганизациямиОстатки.Задача КАК Задача,
	               |	ВзаиморасчетыСОрганизациямиОстатки.Исполнитель КАК Исполнитель,
	               |	ВзаиморасчетыСОрганизациямиОстатки.ФактическаяТрудоемкостьОстаток КАК Трудоемкость,
	               |	ВзаиморасчетыСОрганизациямиОстатки.ФактическаяТрудоемкостьОстаток * ВзаиморасчетыСОрганизациямиОстатки.Задача.Проект.СтоимостьЧаса КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСОрганизациями.Остатки(
	               |			&ДатаСреза,
	               |			Организация = &Организация
	               |				И (Задача.Проект В ИЕРАРХИИ (&Проект)
	               |					ИЛИ &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))) КАК ВзаиморасчетыСОрганизациямиОстатки
	               |ГДЕ
	               |	НЕ ВзаиморасчетыСОрганизациямиОстатки.Задача.ПометкаУдаления
	               |	И НЕ ВзаиморасчетыСОрганизациямиОстатки.Задача.ОтмененаЗадача
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВзаиморасчетыСОрганизациямиОстатки.Задача.ДатаВыполнения";
	
	
	Граница = Новый Граница(Объект.Дата, ВидГраницы.Включая);
	МоментВремениНаДату = Граница.Значение;
	Запрос.УстановитьПараметр("ДатаСреза", МоментВремениНаДату + 1);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	
	Результат = Запрос.Выполнить();
	ТаблицаСписокЗадач = Результат.Выгрузить();
	
	Объект.СписокЗадач.Загрузить(ТаблицаСписокЗадач);
	
	Объект.СуммаОплаты = Объект.СписокЗадач.Итог("Сумма");

КонецПроцедуры // ЗаполнитьРаботыПоЗадачиСервер()

&НаКлиенте
Процедура СписокЗадачЗадачаПриИзменении(Элемент)
	
	РассчитатьТекущуюСтроку(Элементы.СписокЗадач.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Объект.ДатаСтатуса = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	Объект.Оплачено = Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусАктаВыполненныхРабот.Оплачен");
	
	ИзменениеСтатусаОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплаченоПриИзменении(Элемент)
	
	ИзменениеСтатусаОплаты();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменениеСтатусаОплаты()

	Если Объект.Оплачено Тогда
		
		Объект.ДатаОплаты = ОбщегоНазначенияКлиент.ДатаСеанса();
		Объект.СуммаОплаты = Объект.СписокЗадач.Итог("Сумма");
		
		Объект.ДатаСтатуса = Объект.ДатаОплаты;
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусАктаВыполненныхРабот.Оплачен");
		
	Иначе
		
		Объект.ДатаОплаты = '00010101';
		Объект.ДругаяСуммаСогласована = Ложь;
		
		Объект.ДатаСтатуса = ОбщегоНазначенияКлиент.ДатаСеанса();
		
		Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусАктаВыполненныхРабот.Оплачен") Тогда
			Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусАктаВыполненныхРабот.ОжидаетОплаты");
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры // ИзменениеОплачено()

&НаКлиенте
Процедура СписокЗадачТрудоемкостьПриИзменении(Элемент)
	
	РассчитатьТекущуюСтроку(Элементы.СписокЗадач.ТекущиеДанные, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьТекущуюСтроку(ТекущиеДанные, ИзмененаТрудоемкость = Ложь)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыЗадачи = ОбщегоНазначенияКупоросВызовСервера.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Задача , "Исполнитель, Трудоемкость, Проект.СтоимостьЧаса");
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, РеквизитыЗадачи, , "Трудоемкость");
	
	Если ИзмененаТрудоемкость Тогда
	
		ТекущиеДанные.Сумма = ТекущиеДанные.Трудоемкость * РеквизитыЗадачи.ПроектСтоимостьЧаса;
		
	Иначе	
		
		ТекущиеДанные.Трудоемкость = РеквизитыЗадачи.Трудоемкость;
		ТекущиеДанные.Сумма = РеквизитыЗадачи.Трудоемкость * РеквизитыЗадачи.ПроектСтоимостьЧаса;
		
	КонецЕсли;

КонецПроцедуры // РассчитатьТекущуюСтроку()

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
